

DEFAULT_DATA = {
    "application": {
        "title": "세계 상식 퀴즈",
        "menu": {
            "title": "세계 상식 퀴즈",
            "options": [
                "퀴즈 풀기",
                "퀴즈 추가",
                "퀴즈 목록", 
                "점수 확인",
                "종료"
            ],
            "prompt": ">> "
        },
        "highest_score": 0,
        "last_score": 0,
        "version": "1.0.0"
    },

    "quizzes": [
        {
        "category": "국가와 수도",
        "question": "프랑스의 수도는 어디입니까?",
        "choices": [
            "리옹",
            "마르세유",
            "파리",
            "니스"
        ],
        "answer": 3
        },
        {
        "category": "국가와 수도",
        "question": "일본의 수도는 어디입니까?",
        "choices": [
            "오사카",
            "도쿄",
            "교토",
            "나고야"
        ],
        "answer": 2
        },
        {
        "category": "국가와 수도",
        "question": "미국의 수도는 어디입니까?",
        "choices": [
            "뉴욕",
            "로스앤젤레스",
            "시카고",
            "워싱턴 D.C."
        ],
        "answer": 4
        },
        {
        "category": "국가와 수도",
        "question": "영국의 수도는 어디입니까?",
        "choices": [
            "런던",
            "맨체스터",
            "버밍엄",
            "글래스고"
        ],
        "answer": 1
        },
        {
        "category": "국가와 수도",
        "question": "독일의 수도는 어디입니까?",
        "choices": [
            "함부르크",
            "뮌헨",
            "베를린",
            "프랑크푸르트"
        ],
        "answer": 3
        },
        {
        "category": "국가와 수도",
        "question": "이탈리아의 수도는 어디입니까?",
        "choices": [
            "밀라노",
            "로마",
            "나폴리",
            "피렌체"
        ],
        "answer": 2
        },
        {
        "category": "국가와 수도",
        "question": "호주의 수도는 어디입니까?",
        "choices": [
            "캔버라",
            "시드니",
            "멜버른",
            "브리즈번"
        ],
        "answer": 1
        },
        {
        "category": "국가와 수도",
        "question": "캐나다의 수도는 어디입니까?",
        "choices": [
            "토론토",
            "밴쿠버",
            "몬트리올",
            "오타와"
        ],
        "answer": 4
        },
        {
        "category": "국가와 수도",
        "question": "브라질의 수도는 어디입니까?",
        "choices": [
            "상파울루",
            "브라질리아",
            "리우데자네이루",
            "포르투알레그리"
        ],
        "answer": 2
        },
        {
        "category": "국가와 수도",
        "question": "이집트의 수도는 어디입니까?",
        "choices": [
            "알렉산드리아",
            "기자",
            "카이로",
            "룩소르"
        ],
        "answer": 3
        },

        {
        "category": "세계 지리",
        "question": "세계에서 가장 넓은 면적을 차지하는 대양은 어디입니까?",
        "choices": [
            "인도양",
            "대서양",
            "태평양",
            "북극해"
        ],
        "answer": 3
        },
        {
        "category": "세계 지리",
        "question": "세계에서 가장 높은 산인 에베레스트산이 속한 산맥은 무엇입니까?",
        "choices": [
            "안데스 산맥",
            "알프스 산맥",
            "히말라야 산맥",
            "로키 산맥"
        ],
        "answer": 3
        },
        {
        "category": "세계 지리",
        "question": "세계에서 영토 면적이 가장 넓은 국가는 어디입니까?",
        "choices": [
            "캐나다",
            "중국",
            "미국",
            "러시아"
        ],
        "answer": 4
        },
        {
        "category": "세계 지리",
        "question": "세계에서 가장 큰 사막인 사하라 사막은 어느 대륙에 위치해 있습니까?",
        "choices": [
            "아시아",
            "아프리카",
            "남아메리카",
            "오세아니아"
        ],
        "answer": 2
        },
        {
        "category": "세계 지리",
        "question": "대서양과 태평양을 연결하여 배들이 통과할 수 있게 만든 운하의 이름은 무엇입니까?",
        "choices": [
            "수에즈 운하",
            "파나마 운하",
            "코린토스 운하",
            "킬 운하"
        ],
        "answer": 2
        },
        {
        "category": "세계 지리",
        "question": "일반적으로 세계에서 가장 긴 강으로 알려진 강은 무엇입니까?",
        "choices": [
            "아마존강",
            "나일강",
            "미시시피강",
            "양쯔강"
        ],
        "answer": 2
        },
        {
        "category": "세계 지리",
        "question": "지구상에서 면적이 가장 작은 대륙은 어디입니까?",
        "choices": [
            "유럽",
            "남극",
            "오세아니아",
            "남아메리카"
        ],
        "answer": 3
        },
        {
        "category": "세계 지리",
        "question": "세계에서 가장 면적이 큰 섬은 무엇입니까?",
        "choices": [
            "마다가스카르",
            "보르네오",
            "그린란드",
            "뉴기니"
        ],
        "answer": 3
        },
        {
        "category": "세계 지리",
        "question": "유럽 대륙과 아프리카 대륙 사이에 위치한 바다의 이름은 무엇입니까?",
        "choices": [
            "홍해",
            "지중해",
            "흑해",
            "카스피해"
        ],
        "answer": 2
        },
        {
        "category": "세계 지리",
        "question": "남아메리카 대륙의 서쪽을 따라 길게 뻗어 있는 세계 최장의 산맥은 무엇입니까?",
        "choices": [
            "안데스 산맥",
            "히말라야 산맥",
            "알프스 산맥",
            "애팔래치아 산맥"
        ],
        "answer": 1
        },

        {
        "category": "세계 역사",
        "question": "고대 이집트 왕의 무덤으로 알려진 거대한 피라미드가 위치한 국가는 어디입니까?",
        "choices": [
            "그리스",
            "터키",
            "이집트",
            "이탈리아"
        ],
        "answer": 3
        },
        {
        "category": "세계 역사",
        "question": "14세기에서 16세기 사이 유럽에서 일어난 문화와 예술의 부흥 운동을 무엇이라 합니까?",
        "choices": [
            "십자군 전쟁",
            "르네상스",
            "종교개혁",
            "계몽주의"
        ],
        "answer": 2
        },
        {
        "category": "세계 역사",
        "question": "18세기 후반 영국에서 시작되어 증기 기관의 발명과 함께 일어난 경제적 변화를 무엇이라 합니까?",
        "choices": [
            "프랑스 혁명",
            "산업 혁명",
            "명예 혁명",
            "과학 혁명"
        ],
        "answer": 2
        },
        {
        "category": "세계 역사",
        "question": "1789년 '자유, 평등, 박애'를 기치로 내걸고 일어난 유럽의 대표적인 시민 혁명은 무엇입니까?",
        "choices": [
            "미국 독립 혁명",
            "러시아 혁명",
            "프랑스 혁명",
            "명예 혁명"
        ],
        "answer": 3
        },
        {
        "category": "세계 역사",
        "question": "민주주의의 발상지로 알려져 있으며, 소크라테스와 플라톤 같은 철학자를 배출한 고대 그리스의 도시 국가는 어디입니까?",
        "choices": [
            "스파르타",
            "아테네",
            "테베",
            "코린토스"
        ],
        "answer": 2
        },
        {
        "category": "세계 역사",
        "question": "고대 아시아와 유럽을 연결하여 비단과 향신료 등이 거래되었던 무역로의 이름은 무엇입니까?",
        "choices": [
            "비단길(실크로드)",
            "바닷길",
            "초원길",
            "호박길"
        ],
        "answer": 1
        },
        {
        "category": "세계 역사",
        "question": "1492년 유럽인으로서 대서양을 건너 아메리카 대륙에 도달한 탐험가는 누구입니까?",
        "choices": [
            "마젤란",
            "바스쿠 다 가마",
            "콜럼버스",
            "쿡 선장"
        ],
        "answer": 3
        },
        {
        "category": "세계 역사",
        "question": "고대 로마의 원형 경기장으로, 검투사들의 경기나 연극이 상연되었던 장소는 어디입니까?",
        "choices": [
            "파르테논 신전",
            "콜로세움",
            "판테온",
            "개선문"
        ],
        "answer": 2
        },
        {
        "category": "세계 역사",
        "question": "1215년 영국 국왕의 권력을 제한하고 법의 지배를 확립하기 위해 작성된 문서는 무엇입니까?",
        "choices": [
            "독립 선언서",
            "인권 선언",
            "마그나 카르타(대헌장)",
            "권리 장전"
        ],
        "answer": 3
        },
        {
        "category": "세계 역사",
        "question": "프랑스의 황제로 즉위하여 유럽의 많은 지역을 정복하고 법전을 편찬했던 인물은 누구입니까?",
        "choices": [
            "루이 14세",
            "나폴레옹",
            "샤를마뉴",
            "비스마르크"
        ],
        "answer": 2
        },

        {
        "category": "과학 상식",
        "question": "태양계에서 태양과 가장 가까운 위치에 있는 행성은 무엇입니까?",
        "choices": [
            "금성",
            "화성",
            "수성",
            "목성"
        ],
        "answer": 3
        },
        {
        "category": "과학 상식",
        "question": "인체에서 면적이 가장 넓으며 외부로부터 몸을 보호하는 기관은 무엇입니까?",
        "choices": [
            "심장",
            "간",
            "피부",
            "폐"
        ],
        "answer": 3
        },
        {
        "category": "과학 상식",
        "question": "금의 원소 기호로 올바른 것은 무엇입니까?",
        "choices": [
            "Ag",
            "Au",
            "Fe",
            "Cu"
        ],
        "answer": 2
        },
        {
        "category": "과학 상식",
        "question": "만유인력의 법칙을 체계화하여 근대 물리학의 기초를 세운 과학자는 누구입니까?",
        "choices": [
            "알베르트 아인슈타인",
            "토마스 에디슨",
            "아이작 뉴턴",
            "갈릴레오 갈릴레이"
        ],
        "answer": 3
        },
        {
        "category": "과학 상식",
        "question": "식물이 빛 에너지를 이용하여 양분을 만드는 광합성 과정에서 배출되는 기체는 무엇입니까?",
        "choices": [
            "이산화탄소",
            "질소",
            "수소",
            "산소"
        ],
        "answer": 4
        },
        {
        "category": "과학 상식",
        "question": "지구 대기 중에서 가장 높은 비율(약 78%)을 차지하고 있는 기체는 무엇입니까?",
        "choices": [
            "산소",
            "이산화탄소",
            "질소",
            "아르곤"
        ],
        "answer": 3
        },
        {
        "category": "과학 상식",
        "question": "물 분자를 구성하는 원소 기호를 결합한 화학식은 무엇입니까?",
        "choices": [
            "CO2",
            "H2O",
            "NaCl",
            "O2"
        ],
        "answer": 2
        },
        {
        "category": "과학 상식",
        "question": "표면이 산화철로 덮여 있어 붉은색으로 보이기 때문에 '붉은 행성'이라 불리는 것은 무엇입니까?",
        "choices": [
            "목성",
            "토성",
            "화성",
            "금성"
        ],
        "answer": 3
        },
        {
        "category": "과학 상식",
        "question": "새처럼 하늘을 날 수 있지만, 알을 낳지 않고 새끼를 낳아 젖을 먹여 키우는 포유류는 무엇입니까?",
        "choices": [
            "독수리",
            "박쥐",
            "펭귄",
            "타조"
        ],
        "answer": 2
        },
        {
        "category": "과학 상식",
        "question": "전기 회로에서 흐르는 전류의 세기를 나타내는 단위는 무엇입니까?",
        "choices": [
            "볼트(V)",
            "와트(W)",
            "암페어(A)",
            "옴(Ω)"
        ],
        "answer": 3
        },


        {
            "category": "우주·자연",
            "question": "태양계에서 가장 크기가 큰 행성은 무엇입니까?",
            "choices": [
            "수성",
            "목성",
            "화성",
            "해왕성"
            ],
            "answer": 2
        },
        {
            "category": "우주·자연",
            "question": "지구의 유일한 자연 위성으로, 밀물과 썰물 현상에 영향을 주는 천체는 무엇입니까?",
            "choices": [
            "화성",
            "태양",
            "달",
            "금성"
            ],
            "answer": 3
        },
        {
            "category": "우주·자연",
            "question": "우리가 살고 있는 지구가 속해 있는 은하의 이름은 무엇입니까?",
            "choices": [
            "안드로메다 은하",
            "우리 은하",
            "솜브레로 은하",
            "블랙아이 은하"
            ],
            "answer": 2
        },
        {
            "category": "우주·자연",
            "question": "육상 동물 중에서 가장 빠른 속도로 달릴 수 있는 동물은 무엇입니까?",
            "choices": [
            "사자",
            "가젤",
            "치타",
            "표범"
            ],
            "answer": 3
        },
        {
            "category": "우주·자연",
            "question": "지구상에 존재하는 동물 중 몸집이 가장 크고 몸무게가 많이 나가는 포유류는 무엇입니까?",
            "choices": [
            "아프리카코끼리",
            "대왕고래",
            "하마",
            "기린"
            ],
            "answer": 2
        },
        {
            "category": "우주·자연",
            "question": "태양계의 중심에 위치하며 스스로 빛을 내는 항성은 무엇입니까?",
            "choices": [
            "지구",
            "달",
            "태양",
            "목성"
            ],
            "answer": 3
        },
        {
            "category": "우주·자연",
            "question": "달이 태양의 일부 또는 전부를 가리는 현상을 무엇이라고 합니까?",
            "choices": [
            "월식",
            "일식",
            "유성우",
            "오로라"
            ],
            "answer": 2
        },
        {
            "category": "우주·자연",
            "question": "태양계 행성 중 뚜렷하고 아름다운 고리를 가지고 있는 것으로 가장 유명한 행성은 무엇입니까?",
            "choices": [
            "천왕성",
            "토성",
            "목성",
            "해왕성"
            ],
            "answer": 2
        },
        {
            "category": "우주·자연",
            "question": "애벌레가 번데기 과정을 거쳐 나비가 되는 것과 같은 생물의 변화 과정을 무엇이라 합니까?",
            "choices": [
            "광합성",
            "진화",
            "변태",
            "소화"
            ],
            "answer": 3
        },
        {
            "category": "우주·자연",
            "question": "세계에서 가장 큰 단일 꽃으로 알려져 있으며, 강한 악취를 풍겨 곤충을 유인하는 식물은 무엇입니까?",
            "choices": [
            "해바라기",
            "라플레시아",
            "무궁화",
            "장미"
            ],
            "answer": 2
        }

    ]
}

